{
  "project": "desiAgent",
  "branchName": "ralph/stop-signal-capability",
  "description": "Stop Signal Capability - Add stop requests to abort DAG creation and pause execution without breaking APIs",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add stop request persistence",
      "description": "As a developer, I want stop requests stored in the database so multiple workers can detect them and they survive restarts.",
      "acceptanceCriteria": [
        "Add dagStopRequests table with fields: id, dagId, executionId, status, requestedAt, handledAt",
        "Add indexes for dagId, executionId, and status",
        "Add query to fetch most recent requested stop for a dagId or executionId",
        "Add update to mark stop request handled with handledAt",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Expose stop request service methods",
      "description": "As a module consumer, I want service methods to request stops without changing public APIs.",
      "acceptanceCriteria": [
        "Add requestStopForDag(dagId) service method to record a stop request",
        "Add requestStopForExecution(executionId) service method to record a stop request",
        "Methods only record stop requests and do not mutate DAGs or executions",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Abort DAG creation on stop",
      "description": "As a system operator, I want DAG creation to abort when a stop is requested so partial DAGs are not persisted.",
      "acceptanceCriteria": [
        "Check for stop requests before each LLM call (including retries) and before persisting DAG records in createFromGoal",
        "If stop detected and a new DAG was created in the attempt, delete the DAG record",
        "Return status: 'failed' using existing failure response path",
        "Log stop events with dagId or executionId",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Pause DAG execution on stop",
      "description": "As a system operator, I want DAG execution to pause on stop so in-flight work is marked pending and can resume later.",
      "acceptanceCriteria": [
        "Check for stop requests before starting a task and after each task finishes",
        "If stop detected after a task finishes, set dagExecutions.status to 'pending'",
        "Update in-flight dagSubSteps to status 'pending' leaving completed or failed unchanged",
        "Execution returns without throwing",
        "Log stop events with dagId or executionId",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Abort in-flight LLM calls on stop",
      "description": "As a developer, I want LLM calls to cancel promptly when a stop is requested to reduce wasted work.",
      "acceptanceCriteria": [
        "Pass AbortController signal to OpenAI, OpenRouter, and Ollama provider calls",
        "Abort the controller when a stop request is detected to cancel in-flight LLM calls",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    }
  ]
}
